<PAD>
<UNK>
<EOS>
the
.
and
walk
turn
left
right
to
go
of
,
stop
on
room
stairs
into
door
in
down
wait
through
a
at
past
you
hallway
doorway
bedroom
straight
exit
table
enter
then
bathroom
up
with
your
towards
front
take
hall
kitchen
out
forward
around
next
near
by
first
doors
continue
top
bed
chairs
steps
end
make
area
dining
until
there
pass
once
wall
outside
glass
head
open
that
leave
two
chair
inside
couch
toward
living
across
bottom
just
white
when
side
get
double
sink
ahead
before
reach
large
from
second
staircase
step
between
after
fireplace
pool
closet
way
stand
are
house
passed
behind
is
going
it
rug
entrance
set
counter
move
walking
patio
office
landing
'
all
desk
wooden
other
black
small
painting
keep
corner
facing
floor
mirror
red
again
sitting
three
slight
middle
along
bar
laundry
couches
slightly
another
passing
stair
blue
archway
leading
see
entryway
onto
round
window
long
foot
last
an
follow
will
building
carpet
hard
brown
plant
balcony
be
stopping
sliding
piano
few
opening
away
wood
railing
one
island
tv
sign
bench
directly
face
sofa
beside
using
flight
proceed
tub
tables
far
entry
opposite
back
refrigerator
this
light
third
shower
picture
windows
where
"
main
toilet
-
vase
as
ll
under
walkway
sharp
leads
foyer
green
over
entering
corridor
cross
massage
lounge
stairwell
degrees
here
bathtub
s
veer
stairway
path
cabinet
statue
porch
stove
upstairs
lamp
them
which
re
art
dinning
downstairs
television
beds
leather
immediate
garage
potted
hanging
so
big
immediately
four
marble
climb
fridge
has
home
base
grey
coffee
pictures
can
2
exercise
tile
stools
stone
more
arched
flowers
plants
tree
center
dresser
banister
start
edge
pillar
standing
deck
stepping
wine
water
case
paintings
shelves
mat
walls
empty
very
hand
sinks
cabinets
machine
nearest
shelf
metal
screen
feet
bookshelf
christmas
looking
closest
heading
chandelier
washer
halfway
off
fourth
narrow
some
/
clock
elevator
have
dryer
travel
direction
short
purple
bookcase
switch
circular
sculpture
should
yellow
thermostat
about
though
arch
circle
five
stay
above
gym
threshold
come
theater
indoors
pillars
taking
column
furniture
fire
rope
framed
couple
exiting
keeping
brick
desks
level
oven
descend
turning
little
rest
via
gray
spiral
columns
orange
gate
artwork
outdoor
reaching
pantry
need
frame
doorways
library
but
tall
those
closed
lobby
benches
study
ceiling
half
sets
ninety
hot
restroom
striped
following
3
seating
washing
bookshelves
ottoman
he
locker
sofas
for
wicker
fountain
rocking
rail
ping
pong
180
gold
both
intersection
display
tiled
reception
french
pink
pathway
now
extinguisher
flower
sauna
moving
2nd
bath
guitar
square
equipment
u
switches
partition
conference
treadmill
while
single
(
bear
bike
work
zebra
ascend
stool
carpeted
suite
curved
)
lead
silver
seat
destination
located
beige
piece
against
flooring
lockers
space
pot
dark
animal
armchairs
horse
built
arm
nightstand
leftmost
farthest
pews
90
soon
game
covered
mosaic
book
upwards
each
recliner
welcome
quick
cloth
reached
elevators
aisle
master
divider
not
grand
rack
hardwood
curtains
do
vanity
says
till
storage
finish
find
six
ve
man
4
t
den
tapestry
forwards
clear
look
arcade
adjacent
even
cooler
mirrors
fifth
armchair
staircases
outdoors
flights
concrete
opens
smaller
great
hammock
en
beach
jacuzzi
iron
entered
o
phone
row
curve
giant
trees
continuing
degree
oval
close
planter
position
machines
parallel
mini
place
colorful
exterior
marked
platform
breakfast
ground
photos
ovens
fitness
fan
faucet
alongside
poster
locate
ballroom
vent
almost
utility
counters
visible
rocks
doormat
staying
drawers
underneath
towel
heater
alcove
portrait
movie
decoration
shaped
either
cellar
entire
length
rooms
midway
ladder
dog
towels
microwave
box
basket
..
buffet
prior
or
holes
pillows
colored
beyond
beginning
kitchenette
tan
books
drum
rectangular
seats
men
floors
runner
roped
abstract
sidewalk
arrive
rock
downwards
these
same
grass
further
grill
marilyn
meeting
bit
leaving
panel
1
sectional
candles
upon
well
workout
railings
turns
immediatly
rightmost
5
family
dishwasher
print
stones
monroe
lower
radiator
garden
chaise
curtain
45
console
hang
frosted
passageway
diagonally
basketball
ropes
board
countertop
vases
checkered
barber
without
nook
section
flag
coat
its
part
loveseat
barrier
ornate
computer
ends
wet
like
guardrail
wardrobe
sconce
air
several
photo
lamps
support
making
spa
floral
wide
begin
climbing
unfinished
sixth
floored
trash
mounted
court
patterned
church
frames
line
bedrooms
let
clockwise
women
arches
final
granite
lights
break
velvet
dots
loft
angle
post
love
altar
shoes
opened
3rd
swing
many
full
fancy
hit
dot
recreation
waiting
baskets
pots
pattern
statues
painted
lattice
below
cactus
planters
decorative
blanket
bust
bush
approach
descending
tennis
cheetah
upper
pillow
credenza
labeled
copy
winding
froward
mirrored
washroom
put
american
stall
arc
#
folding
bridal
remaining
furthest
drinking
;
started
meet
curving
looks
beneath
tot
our
curves
swinging
host
swimming
placed
clothes
golden
arrow
comforter
distance
chest
tiles
seven
containing
tops
old
no
goes
sailboat
eighty
still
girl
yourself
pas
bowl
design
flat
backyard
rounded
bigger
hundred
also
archways
screened
garbage
posters
structure
walked
extreme
larger
easel
footstool
promptly
eight
photographs
recliners
hallways
getting
kids
changes
thing
salon
giraffe
infront
object
. .
don
pocket
holding
plaque
openings
dinner
fork
topped
filled
shelving
tablecloth
backside
interior
cushioned
stained
only
telephone
nest
ladies
low
stars
dogleg
children
woman
armoire
paper
veering
bushes
number
rugs
wreath
bin
overlooking
loungers
use
sit
arrangement
billiard
oriental
billiards
gallery
urn
settee
areas
closets
ledge
foosball
avoid
panes
construction
cylinder
ascending
fence
too
cushions
watermelon
if
bottles
night
ship
passage
current
barstools
drawer
terrace
than
11
reading
nearby
twin
bathrooms
fruit
restrooms
rear
central
pivot
lounging
pedestal
brass
starting
dressing
grandfather
saxophone
burgundy
doorframe
followed
goal
doorknob
alter
banquet
point
cement
lady
palm
cupboards
gravel
jump
entertainment
decorations
steel
indoor
handle
beam
polka
feather
ball
thought
mats
made
straw
unit
hutch
roof
dividers
keyboard
entrances
they
approximately
fiction
portraits
zebras
padded
faced
handing
wrap
paneled
carpeting
skin
cow
finally
guitars
woven
fake
projector
marbled
car
huge
4th
talk
view
were
any
theatre
pair
sunset
stacked
pole
pulp
deer
teh
enerskin
trunk
6
surrounded
enclosed
lit
plywood
leopard
arrived
formal
candle
lounger
sides
pipes
bird
body
plate
elliptical
hangings
lines
crossing
spot
pgi
son
pause
powder
grate
pig
treadmills
